In [1]:
import pandas as pd

In [6]:
dfUSD = pd.read_csv('us-dollar-index-historical-chart.csv', skiprows = 15)

dfUSD.head()

         date    value
0  1973-01-01  107.616
1  1973-02-01  103.046
2  1973-03-01  100.000
3  1973-04-01  100.376
4  1973-05-01   99.263

In [10]:
dfUSD = dfUSD.dropna()

In [11]:
len(dfUSD)

564

In [14]:
#1983-2013
for index, row in dfUSD.iterrows():
    strDate = row['date']
    split = strDate.split('-')
    year = split[0]
    month = split[1]
    dfUSD.at[index, 'year'] = int(year)
    dfUSD.at[index, 'month'] = int(month)

In [15]:
dfUSD.head()

         date    value    year  month
0  1973-01-01  107.616  1973.0    1.0
1  1973-02-01  103.046  1973.0    2.0
2  1973-03-01  100.000  1973.0    3.0
3  1973-04-01  100.376  1973.0    4.0
4  1973-05-01   99.263  1973.0    5.0

In [50]:
dfUSDTrimmed = dfUSD.query('(year > 1983 & year < 2013) or (year == 1983 & month >= 4)')
del dfUSDTrimmed['date']
dfUSDTrimmed.shape

(357, 3)

In [43]:
dfUSDTrimmed.rename(columns = {' value': 'value'}, inplace = True)

In [47]:
dfUSDTrimmed['year'] = dfUSDTrimmed['year'].astype('int64')
dfUSDTrimmed['month'] = dfUSDTrimmed['month'].astype('int64')

dfUSDTrimmed.head()

     year  month    value
123  1983      4  109.066
124  1983      5  109.292
125  1983      6  110.775
126  1983      7  111.495
127  1983      8  113.021

In [48]:
dfUSDTrimmed = dfUSDTrimmed[['year', 'month', 'value']]
dfUSDTrimmed.head()

     year  month    value
123  1983      4  109.066
124  1983      5  109.292
125  1983      6  110.775
126  1983      7  111.495
127  1983      8  113.021

In [49]:
dfUSDTrimmed.to_csv('USDClean.csv', index = False)

In [51]:
#sqalchemy stuff
from sqlalchemy import create_engine

In [52]:
engine = create_engine('postgresql://postgres:postgres@localhost:5432/ETL')

In [53]:
connection = engine.connect()

In [54]:
dfUSDSQL = pd.read_sql('select * from USD', connection)
dfUSDSQL.head()

   year  month    value
0  1983      4  109.066
1  1983      5  109.292
2  1983      6  110.775
3  1983      7  111.495
4  1983      8  113.021